org-content/notes-lecture-ETransport.org
#+title: 400A - Diffusive energy transport
#+author: Mathieu Renzo
#+email: mrenzo@arizona.edu
#+PREVIOUS_PAGE: notes-lecture-EOS2.org
#+NEXT_PAGE: notes-lecture-kappa.org

*Materials*: Chapters 3 and 5 of Onno Pols' lecture notes, chapter 5 of
Kippenhan & Weigert's book.

* Energy transport in stars
** Summary of where we are
*** Mass conservation:
#+begin_latex
\begin{equation}\label{eq:mass_cont}
\frac{dm}{dr} = 4\pi \rho r^{2} \ \ .
\end{equation}
#+end_latex

*** Hydrostatic equilibrium:
#+begin_latex
\begin{equation}\label{eq:HSE}
\frac{dP}{dr} = -\frac{Gm}{r^{2}}\rho \ \Leftrightarrow \ \frac{dP}{dm} = - \frac{Gm}{4\pi r^{4}} \ \ ,
\end{equation}
#+end_latex
where we use Eq. \ref{eq:mass_cont} to use a Lagrangian mass
coordinate as independent functional variable.

*N.B.:* This is the particular form that momentum conservation takes
since we can assume accelerations are \sim0 because stars do not evolve
on timescales comparable to the dynamical timescale

*** Equation of state:
#+begin_latex
\begin{equation}\label{eq:EOS}
P \equiv P(\rho, \mu, T) = P_\mathrm{rad} + P_\mathrm{gas} = \frac{1}{3}aT^{4} + \frac{\rho}{\mu m_{u}}k_{B}T + P_\mathrm{QM}\ \ .
\end{equation}
#+end_latex

These three equations have as variables m \equiv m(r) (or equivalently r\equiv
r(m)), P, \rho, and T. By adding an EOS to relate P and \rho (and the
composition of the star which enters in the mean molecular weight \mu),
in the general case, we have also added a new variable T, so the
system is not close again, and we need to look for one more equation
to be able to solve it! In today's lecture we will actually derive
two: energy transport and energy conservation. However, today for the
former we will not cover yet all possible physical situations in
stars.

** Energy flow in stars

To find another equation, we can consider how energy flows in a star.
We have already seen that the "surface" temperature (e.g., of the Sun),
and the average temperature (estimated using the [[./notes-lecture-VirTheo.org][virial theorem]]) are
/not/ the same, so we know that the star is /not/ in global thermal
equilibrium. We also know, from similar arguments, that the average
temperature is higher than the surface temperature, so there should be
an energy flow from the interior outwards.

This energy flow can occur in three forms in a star:
1. *Diffusion*: thermal energy can be moved by the random motion of
   particles. This is often the dominant energy transport mechanism in
   a star -- unless for some reason it is insufficient. The diffusion
   of energy can be:
   - *Radiative*, if the particles carrying the energy through their
     random motion are photons
   - *Conductive*: if it is the thermal motion of gas particles
     (typically electrons, unless you are in a neutron star) that
     carries the energy
2. *Convection*: in this case thermal energy is transported by bulk
   motion of matter. This occurs as an instability if the other
   means of energy transport are insufficient to carry the energy flux
   required by the local stellar structure, and it will be the topic
   of a [[./notes-lecture-convection.org][future lecture]].
3. *Neutrino losses*: except for collapsing iron cores and neutron
   stars, the stellar gas is transparent to neutrinos. As soon as one
   is produced, it can free stream out of the star carrying away
   energy effectively instantaneously (or more precisely on a
   timescale \sim R/v_{\nu} \simeq R/c comparable to the light crossing time
   if neutrinos are non interacting and we neglect their mass, so they
   are ultra-relativistic particles with v_{\nu}\simeq c).

The next /two/ stellar structure equations to add to our system will
come from combining all of these together and applying conservation of
energy.

