html-content/notes-lecture-ETransport.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-13 Thu 09:24 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>400A - Diffusive energy transport</title>
<meta name="author" content="Mathieu Renzo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./css/style.css" />
<link rel="stylesheet" href="./fontawesome-free-6.7.2-web/css/all.min.css">
<meta name="keywords" content="Mathieu, Renzo, Mathieu Renzo,
			       stellar evolution, 400A, University of
			       Arizona, Steward Observatory, stars,
			       theoretical astrophysics">
</head>
<body>
<div id="preamble" class="status">
<!-- Preamble -->
<!-- The header -->
<div class="header">

  <!-- The site name -->
  <div class="site-name">
    <a id="top" href="./index.html">Stellar Evolution</a>
  </div>

  <!-- The hamburger -->
  <div class="hamburger">
    <div id="myLinks" class="menu">
      <a href="./index.html">Home</a>
      <a href="./syllabus.html">Syllabus</a>
      <a href="./lectures.html">Lectures</a>
      <a href="./projects.html">Projects</a>
    </div>
    <a  href="javascript:void(0);" class="icon" onclick="HamburgerMenuFunction()">
      <i class="fa fa-bars"></i>
    </a>
  </div>

  <div class="navbar">
    <a href="./syllabus.html">Syllabus</a>
    <a href="./lectures.html">Lectures</a>
    <a href="./projects.html">Projects</a>
  </div>
</div>

<!-- scripts -->
<script>
  function HamburgerMenuFunction() {
      var x = document.getElementById("myLinks");
      if (x.style.display === "block") {
	  x.style.display = "none";
      } else {
	  x.style.display = "block";
      }
  }
</script>

<script>
  window.onload = () => {
      const toggleButton = document.getElementById("light-dark-toggle");
      const body = document.body;
      const html = document.documentElement;


      // Check localStorage for user preference
      if (localStorage.getItem("theme") === "dark") {
          body.classList.add("dark-mode");
	  html.classList.toggle("dark-mode");
      }

      // Toggle theme on click
      toggleButton.addEventListener("click", () => {
          body.classList.toggle("dark-mode");
	  html.classList.toggle("dark-mode");

          // Save user preference
          if (body.classList.contains("dark-mode")) {
              localStorage.setItem("theme", "dark");
          } else {
              localStorage.setItem("theme", "light");
          }
      });
  };
</script>
<!-- end scripts-->
</div>
<div id="content" class="content">
<p>
<b>Materials</b>: Chapters 3 and 5 of Onno Pols' lecture notes, chapter 5 of
Kippenhan &amp; Weigert's book.
</p>

<div id="outline-container-orgab12b41" class="outline-2">
<h2 id="orgab12b41"><a href="#orgab12b41">Energy transport in stars</a></h2>
<div class="outline-text-2" id="text-orgab12b41">
</div>
<div id="outline-container-org9ccd5a6" class="outline-3">
<h3 id="org9ccd5a6"><a href="#org9ccd5a6">Summary of where we are</a></h3>
<div class="outline-text-3" id="text-org9ccd5a6">
</div>
<div id="outline-container-orgda0b8a5" class="outline-4">
<h4 id="orgda0b8a5"><a href="#orgda0b8a5">Mass conservation:</a></h4>
<div class="outline-text-4" id="text-orgda0b8a5">
<div class="latex" id="orgdb111d2">
\begin{equation}\label{eq:mass_cont}
\frac{dm}{dr} = 4\pi \rho r^{2} \ \ .
\end{equation}

</div>
</div>
</div>

<div id="outline-container-orgbfadb02" class="outline-4">
<h4 id="orgbfadb02"><a href="#orgbfadb02">Hydrostatic equilibrium:</a></h4>
<div class="outline-text-4" id="text-orgbfadb02">
<div class="latex" id="orgbe56493">
\begin{equation}\label{eq:HSE}
\frac{dP}{dr} = -\frac{Gm}{r^{2}}\rho \ \Leftrightarrow \ \frac{dP}{dm} = - \frac{Gm}{4\pi r^{4}} \ \ ,
\end{equation}

</div>
<p>
where we use Eq. \ref{eq:mass_cont} to use a Lagrangian mass
coordinate as independent functional variable.
</p>

<p>
<b>N.B.:</b> This is the particular form that momentum conservation takes
since we can assume accelerations are &sim;0 because stars do not evolve
on timescales comparable to the dynamical timescale
</p>
</div>
</div>

<div id="outline-container-org17b1656" class="outline-4">
<h4 id="org17b1656"><a href="#org17b1656">Equation of state:</a></h4>
<div class="outline-text-4" id="text-org17b1656">
<div class="latex" id="orge0220fd">
\begin{equation}\label{eq:EOS}
P \equiv P(\rho, \mu, T) = P_\mathrm{rad} + P_\mathrm{gas} = \frac{1}{3}aT^{4} + \frac{\rho}{\mu m_{u}}k_{B}T + P_\mathrm{QM}\ \ .
\end{equation}

</div>

<p>
These three equations have as variables m &equiv; m(r) (or equivalently r&equiv;
r(m)), P, &rho;, and T. By adding an EOS to relate P and &rho; (and the
composition of the star which enters in the mean molecular weight &mu;),
in the general case, we have also added a new variable T, so the
system is not close again, and we need to look for one more equation
to be able to solve it! In today's lecture we will actually derive
two: energy transport and energy conservation. However, today for the
former we will not cover yet all possible physical situations in
stars.
</p>
</div>
</div>
</div>

<div id="outline-container-orge7cb4a8" class="outline-3">
<h3 id="orge7cb4a8"><a href="#orge7cb4a8">Energy flow in stars</a></h3>
<div class="outline-text-3" id="text-orge7cb4a8">
<p>
To find another equation, we can consider how energy flows in a star.
We have already seen that the "surface" temperature (e.g., of the Sun),
and the average temperature (estimated using the <a href="./notes-lecture-VirTheo.html">virial theorem</a>) are
<i>not</i> the same, so we know that the star is <i>not</i> in global thermal
equilibrium. We also know, from similar arguments, that the average
temperature is higher than the surface temperature, so there should be
an energy flow from the interior outwards.
</p>

<p>
This energy flow can occur in three forms in a star:
</p>
<ol class="org-ol">
<li><b>Diffusion</b>: thermal energy can be moved by the random motion of
particles. This is often the dominant energy transport mechanism in
a star &#x2013; unless for some reason it is insufficient. The diffusion
of energy can be:
<ul class="org-ul">
<li><b>Radiative</b>, if the particles carrying the energy through their
random motion are photons</li>
<li><b>Conductive</b>: if it is the thermal motion of gas particles
(typically electrons, unless you are in a neutron star) that
carries the energy</li>
</ul></li>
<li><b>Convection</b>: in this case thermal energy is transported by bulk
motion of matter. This occurs as an instability if the other
means of energy transport are insufficient to carry the energy flux
required by the local stellar structure, and it will be the topic
of a <a href="./notes-lecture-convection.html">future lecture</a>.</li>
<li><b>Neutrino losses</b>: except for collapsing iron cores and neutron
stars, the stellar gas is transparent to neutrinos. As soon as one
is produced, it can free stream out of the star carrying away
energy effectively instantaneously (or more precisely on a
timescale &sim; R/v<sub>&nu;</sub> &cong; R/c comparable to the light crossing time
if neutrinos are non interacting and we neglect their mass, so they
are ultra-relativistic particles with v<sub>&nu;</sub>&cong; c).</li>
</ol>

<p>
The next <i>two</i> stellar structure equations to add to our system will
come from combining all of these together and applying conservation of
energy.
</p>
</div>
</div>
