org-content/notes-lecture-ETransport.org
** Diffusion processes
In general, the "diffusion approximation" is useful to describe the
net flux of "something" when the average path of the carrier of said
"something" is small compared to the lengthscale over which the
"something" is transported, that is the mean free path $\ell$ is much smaller
than the size $L$ of the region $\ell \ll L$.

In this approximation, the net flux of this "something" is related to
the density of "something" by Fick's law:

#+begin_latex
\begin{equation}\label{eq:diff}
\mathbf{J} = - D\nabla n \ \ ,
\end{equation}
#+end_latex

where $\mathbf{J}$ is the flux (which is in general a vector
quantity), $D$ is the so called "diffusion coefficient", and $\nabla n$ is
the gradient of the volumetric density of the "something" we are
considering. The negative sign appears because the flux is opposite to
the gradient ("something" flows from where there is a lot to where
there is less!). By dimensional analysis, regardless of what
"something" is (and what are its dimensions), you can see that:
- [$J$] = [something]/(L^{2}t) with L length dimension and t time;
- [$\nabla$] \equiv [$d/dx$] = 1/L;
- [$n$] = [something]/L^{3}

Therefore, the diffusion coefficient has the dimensions of [$D$] =
L^{2}/t \equiv v \times L, so we can expect $D$ to be proportional to the average
velocity of the "something" that is diffusing times the length scale
for the motion of this something (which by hypothesis is small
compared to the length scale over which we want to study the motion of
this "something"). In fact this is almost all there is to know!

To get the correct pre-factor, let's say "something" are particles
moving in 3 dimensions and focus on one direction, say $z$. If all
these particles have a mean free path $\ell$ and an average velocity $v$,
then the number that crosses a given coordinate $z$ with a positive $\delta
z$ as a function of time is:
#+begin_latex
\begin{equation}
\frac{dN}{dt}(z) =\frac{1}{2} n \frac{1}{3}v \ \ ,
\end{equation}
#+end_latex
where the first 1/2 factor comes from the fact that their motion is
random, so half the particles have negative $\delta z$ and half have a
positive one, and we just want to count the latter, and the factor of
1/3 in front of their average velocity comes from the fact that the
motion is isotropic (see [[file:notes-lecture-EOS1.org::*Ideal gas][derivation of the pressure]]).

If there is a gradient $\partial n /\partial z$ of particles along the $z$ direction,
the particles moving with positive $\delta z$  come from $n(z-\ell)$
while those moving with the negative $\delta z$  come from $n(z+\ell)$, so the net
flux across $z$ is

#+begin_latex
\begin{equation}
J = \frac{dN}{dt}(z-\ell) -\frac{dN}{dt}(z+\ell) = \frac{1}{6}v\left(n(z-\ell)-n(z+\ell)\right)\simeq\frac{1}{6}v\left(-2\ell\frac{\partial n}{\partial z}\right) = -\frac{1}{3}v\ell\frac{\partial n}{\partial z} \ \ ,
\end{equation}
#+end_latex
where the only approximation we use is a first order Taylor expansion
of the density $n(z)$ assuming that the mean free path \ell is small
compared to the scale of interest! Eq. \ref{eq:diff} is the
generalization in 3 dimensions of the above, where $\nabla = (\partial_{x}, \partial_{y},
\partial_{z})$ for Cartesian coordinates, and $D=v\ell/3$.

