html-content/notes-lecture-ETransport.html

<div id="outline-container-orgcae4028" class="outline-4">
<h4 id="orgcae4028"><a href="#orgcae4028">Energy transport by radiative diffusion</a></h4>
<div class="outline-text-4" id="text-orgcae4028">
<p>
We have already calculated that <a href="notes-lecture-EOS1.html#orgbed9b53">mean free path for photons</a>
\(\ell_{\gamma}\) and estimated that it is very small compared to the typical
size of stars (and the typical size of a resolution element in a
numerical simulation of a star!). Therefore, we can treat the energy
transport by photons in the diffusion approximation.
</p>

<p>
<b>N.B.</b>: if the star were a perfect black body, there would not be any
transport of energy by photons, because by definition the radiation
field would be isotropic, and the gradient of photon energy density
would be zero! In reality, we have already seen that stars are <i>not</i>
black bodies at the surface (in the atmospheric layers where \(\ell_{\gamma}\)
is not small) and neither they are in the interior because there is a
small deviation from LTE of the order of \(\ell_{\gamma} dT/dr\sim10^{-4}\) K.
While this is a small enough deviation that we can assume LTE to write
down an EOS, it is also big enough to introduce a non-negligible flux
of energy in the stars!
</p>

<p>
If the "something" that we are considering in our diffusion equation
is energy, then in Eq. \ref{eq:diff} \(J\rightarrow F_\mathrm{rad}\) is a energy flux of
radiative energy, and \(n\rightarrow u\) is the energy density. Moreover, in the
diffusion coefficient \(D\) the mean velocity of photons is \(v\rightarrow c\), and we
have already written \(\ell_{\gamma} = 1/\kappa_\mathrm{rad}\rho\) as a function of \(\rho\).
</p>

<p>
<b>N.B.:</b> today we will introduce different kinds of opacity \(\kappa\), \(\kappa_\mathrm{rad}\) is
the one impeding the diffusion of photons.
</p>

<p>
Thus, the radiative diffusion equation is
</p>
<div class="latex" id="org7146fef">
\begin{equation}
F_\mathrm{rad} = - \frac{1}{3}\frac{c}{\kappa_\mathrm{rad}\rho}\frac{du}{dr} \ \ ,
\end{equation}

</div>
<p>
where we use the spherical symmetry of the problem to explicit the
gradient and turn it into a total derivative. The radiation energy
density is \(u=aT^{4}\). We can then explicit these into our equation
obtaining:
</p>

<div class="latex" id="orgc0834df">
\begin{equation}
F_\mathrm{rad} = -\frac{4ac}{3\rho} \frac{T^{3}^{}}{\kappa_\mathrm{rad}}\frac{dT}{dr} \ \ ,
\end{equation}

</div>

<p>
which can be turned into an equation for the temperature gradient.
This is a <i>local</i> quantity and it is valid in a region of the star where
the dominant energy transport is radiative diffusion only:
</p>

<div class="latex" id="orga4a0575">
\begin{equation}
\frac{dT}{dr} = -\frac{3}{4ac}\frac{\rho}{T^{3}}\kappa_\mathrm{rad} F_\mathrm{rad} \propto \kappa_\mathrm{rad} F_\mathrm{rad}.\ \ .
\end{equation}

</div>
<p>
<b>In a radiative region the temperature is proportional to the opacity
\(\kappa_\mathrm{rad}\) times the radiative energy flux!</b>
</p>

<p>
We can further rewrite the flux \(F_\mathrm{rad} = L_\mathrm{rad}/(4\pi r^{2})\). This introduces
the <i>local</i> luminosity \(L_\mathrm{rad}\equiv L_\mathrm{rad}(r)\) which is the rate (that is
per unit time) at which radiation transports energy through a surface
of radius \(r\) within the star (or in other words, the "power" that is
in the photon field at the location r):
</p>

<div class="latex" id="orgf2f7a8f">
\begin{equation}
\frac{dT}{dr} = -\frac{3}{16 \pi ac}\frac{\rho\kappa_\mathrm{rad}}{r^{2}}\frac{L_\mathrm{rad}}{T^{3}} \ \ .
\end{equation}

</div>

<p>
This is, for the case of radiative energy transport only, the extra
differential equation relating T and &rho;, but unfortunately it also
brings in a new variable, the local radiative luminosity \(L_\mathrm{rad}\).
</p>

<p>
<b>N.B.:</b> If radiative energy transport is the <b>only</b> energy transport
mechanism at radius \(r\) (that is no convection, no neutrino emission
and no electron conduction), then \(L_\mathrm{rad}(r)\equiv L(r)\) where
\(L(r)\) is the <i>total</i> luminosity at that location in the star. This is
in general not true because of the contribution by neutrinos and
convection: \(L(r) = L_\mathrm{rad} (r)+ L_\mathrm{cond} (r) + L_{\nu}
(r)+L_\mathrm{conv}(r)\).
</p>

<p>
<b>N.B.:</b> Yes, we are introducing yet two other variables, \(L_\mathrm{rad}\) and
\(\kappa_\mathrm{rad}\) here. We will have to write an equation for the former, but
fortunately for us \(\kappa_\mathrm{rad}\) is determined by atomic and particle
physics, as <a href="notes-lecture-kappa.html">we will see in the next lecture</a>. While this is an active
topic of research (including classified research for military
purposes&#x2026;), for stellar physics application we have lookup tables
for \(\kappa_\mathrm{rad}\equiv\kappa_\mathrm{rad}(T,\rho)\), and thus we will not count it as a
new variable after discussing the physics it represents.
</p>

<p>
Because of the assumption underpinning the diffusion approximation,
this is <i>not</i> the right equation whenever \(\ell_{\gamma}\) is not negligible
compared to the scale over which one wants to consider the gradient:
in the stellar atmosphere we need a more detailed approach requiring
to treat the radiative transfer.
</p>

<p>
Now, before looking at the equation for \(L_\mathrm{rad}\), it is useful to consider
next the case where energy is carried not by photons, but by the local
motion of particles, that is <b>conduction</b>.
</p>
</div>
</div>
