html-content/notes-lecture-ETransport.html

<div id="outline-container-org021e33e" class="outline-4">
<h4 id="org021e33e"><a href="#org021e33e">Energy transport by conduction</a></h4>
<div class="outline-text-4" id="text-org021e33e">
<p>
Energy transport by diffusion, and especially conduction that is
diffusion of energy through particle motion, is not limited to stars.
For example, in a piece of metal left half in the Sun and half in the
shade, the thermal motion of particles (atoms, electrons, ions)
carries energy from the hotter parts to the colder ones, and the
transfer occurs through collisions between the loose electrons in the
metallic energy bands.
</p>

<p>
Conduction, although always present, is important only in certain kind
of stars. To demonstrate this, we can consider the diffusion
coefficient \(D\simeq v\ell/3\) and compare it to the radiative diffusion
coefficient \(D_\mathrm{rad} = c\ell_{\gamma}/3 =c/(3\kappa\rho)\). In the diffusion
coefficient \(D\), the velocity that appears is the thermal velocity of
the particles (\(v^{2}\simeq 2k_{B}T/m\) for a non-relativistic gas): at a
given temperature \(T\), the least massive particles are faster, and
will contribute more to the conduction of thermal energy. In a star,
this means the electrons are going to dominate conduction whenever
there is some.
</p>

<p>
The other thing to consider is the mean free path &ell;, but since the
collisional (Coulomb-scattering) \(\sigma \leq 10^{-18}\) cm<sup>2</sup>, the mean free path
\(\ell = 1/(n_{e}\sigma) \ll \ell_{\gamma}\) . Thus, since \(v\le c\) and
\(\ell\ll\ell_{\gamma}\) for most stars energy conduction by particle (electron)
collisions is sub-dominant compared to radiative energy.
</p>

<p>
Things are different though for degenerate electron gas (so inside
white dwarfs and neutron stars, but also evolved stellar cores that
are dense enough for degeneracy to occur). In the case of degeneracy,
the thermal velocities increase (up to \(v \simeq c\) for an degenerate gas
of ultra-relativistic electrons!), and the mean-free path for
electron-electron scattering also increases, because for such a
scattering to be possible the final state must be available for an
electron to populate it, but in the case of (partial) degeneracy
(most) states in the "Fermi sea", with \(\varepsilon\le \varepsilon_\mathrm{Fermi}\) are <b>not</b>
available.
</p>

<p>
In general though, in (partially) degenerate layers of the star we
cannot neglect conduction, and it can dominate over radiative
diffusion even! To consider it, we can follow the same reasoning as
above and write an equation for the conductive flux
</p>
<div class="latex" id="orgcfb42ee">
\begin{equation}
F_\mathrm{cond} = - \frac{1}{3}\frac{c}{\kappa_\mathrm{cond}\rho}\frac{d T}{dr} \ \ ,
\end{equation}

</div>
<p>
where we are implicitly defining a "conductive opacity"
\(\kappa_\mathrm{cond}\) and assuming that the energy density of the gas is
proportional to the temperature \(T\) (not a big assumption, since we
know we are very close to LTE, so we can define a local \(T\)). With
this implicit definition of \(\kappa_\mathrm{cond}\) then we can just sum the
contribution to the energy flux from radiative diffusion and
conduction: \(F = F_\mathrm{rad} + F_\mathrm{cond}\) and
</p>

<div class="latex" id="orge918a14">
\begin{equation}
F = - \frac{1}{3}\frac{c}{\kappa\rho}\frac{d T}{dr} \ \ ,
\end{equation}

</div>
<p>
where now
</p>
<div class="latex" id="orgdd65bf5">
\begin{equation}\label{eq:kappas}
\frac{1}{\kappa} = \frac{1}{\kappa_\mathrm{rad}} + \frac{1}{\kappa_\mathrm{cond}} \ \ .
\end{equation}

</div>

<p>
In the absence of convection (which we will treat <a href="https://www.as.arizona.edu/~mrenzo/materials/Convection.pdf">later</a>) and neutrinos
(which leave the star instantaneously without further interaction,
unless it's a neutron star), this \(F_\mathrm{rad} + F_\mathrm{conv}\)
is the total energy flux.
</p>

<p>
From Eq. \ref{eq:kappas} we can infer an interpretation of these
radiative and conductive opacities, which is corroborating the
definition of \(\kappa\): the equation corresponds to the combination of two
resistances in parallel! \(\kappa_{i}\) is the "resistance" to the flow of
energy carried by radiation (\(i=\mathrm{rad}\)) or particle collisions
(\(i=\mathrm{cond}\)). The lowest resistance allows for the largest
energy flux, and the star will use that mechanism as the dominant
energy transport.
</p>

<p>
Moreover, since we have <i>defined</i> \(\kappa_\mathrm{cond}\) so that the
conductive flux has the same form as the radiative flux, we can (using
Eq. \ref{eq:kappas} and \(L(r) = L_\mathrm{rad} + L_\mathrm{cond}\))
continue the analogy and write down:
</p>

<div class="latex" id="orgd1185ce">
\begin{equation}
\frac{dT}{dr} = -\frac{3}{16 \pi ac}\frac{\rho\kappa}{r^{2}}\frac{L}{T^{3}} \ \ ,
\end{equation}

</div>

<p>
which is the radiative+conductive energy transport equation that
related \(T\), \(\rho\), and the new variable \(L\equiv L(r)\equiv L(m)\) we introduced and
depends on the opacity (radiative and conductive combined in parallel)
\(\kappa\), which we treat as a parameter dependent on atomic and condensed
matter physics (\(\kappa\equiv\kappa(T,\rho)\)).
</p>

<p>
<b>N.B.:</b> For conduction, we have considered the motion of electrons as
the ions are "frozen in place" since \(v_{e} \gg v_\mathrm{ions}\).
However, this will quickly lead to a <i>local</i> charge imbalance! In stars
where conduction is important (typically at least partially
degenerate) there will be a small but non-zero electric field created
by this charge imbalance that slows down the electrons, until their
motion is such that there is a net transfer of their thermal energy
without any net motion of electrons!
</p>
</div>
</div>
</div>
