html-content/notes-lecture-ETransport.html

<div id="outline-container-orgbebc84e" class="outline-3">
<h3 id="orgbebc84e"><a href="#orgbebc84e">Local energy conservation</a></h3>
<div class="outline-text-3" id="text-orgbebc84e">
<p>
Let's finally write an equation for the <i>local</i> luminosity in a star \(L\)
that we have introduced above. Since the luminosity is just the local
"power", it makes sense to look into the <i>local</i> energy conservation to
derive such equation. For a unit mass, the "first law of
thermodynamics" states that the change \(d u\) in internal energy (the
specific internal energy) is equal to the heat added/extracted \(d q\)
plus the work done on the unit mass \(Pd v\) with \(v=1/\rho\) the specific
volume:
</p>

<div class="latex" id="org1b9f272">
\begin{equation}
d u = d q + Pd v \equiv d q - \frac{P}{\rho^{2}}d\rho \ \ ,
\end{equation}

</div>
<p>
where we express things as a function of the density &rho; which already
appears in the other equations.
</p>

<ul class="org-ul">
<li><b>Q</b>: if we compress the gas (\(d\rho > 0\) because \(\rho\) increases), without
adding/extracting heat (\(d q = 0\)) what happens to the internal
energy?</li>
</ul>

<p>
The heat term in a star can only be due to:
</p>
<ul class="org-ul">
<li>energy generation by an internal source (nuclear fusion!), which can
release per unit mass and time energy equal to \(\varepsilon_\mathrm{nuc}\) ([\(\varepsilon_\mathrm{nuc}\)] =[E]/([t][M])).</li>
<li>energy loss by some particle escaping, this can be for example
neutrinos &nu;. Neutrinos in a star can come from nuclear reactions and
they effectively just reduce \(\varepsilon_\mathrm{nuc} \rightarrow \varepsilon_\mathrm{nuc} -
  \varepsilon_{\nu, \mathrm{nuc}}\), or they can come from so-called <b>cooling
processes</b>, for example \(e^{-} +\gamma \rightarrow e^{-} + \nu + \bar{\nu}\),
which really decrease the energy by extracting internal energy,
since as soon as they are produced neutrinos will leave the star
with no further interaction (with the exception of neutron stars).
The neutrino energy cooling rate per unit mass is indicated by \(\varepsilon_{\nu}\)
and it has always a <b>negative</b> contribution to the heat (it's a loss
term for the star)</li>
<li>energy can flow in and out from the boundary of a thin shell of
matter. Above, we have defined: \(L = 4\pi r^{2} F\) (where now both \(L\)
and \(F\) include the contribution from conduction and radiation).
Therefore, the energy per unit time coming from below is \(L\equiv L(m)\)
and the energy per unit time leaking from above is \(L(m+dm)\), to
obtain the specific energy per unit mass we just divide by \(dm\).</li>
</ul>

<p>
Putting all these together we have, at a given mass location m
</p>
<div class="latex" id="orgd5f85a0">
\begin{equation}
dq(m) = \varepsilon_\mathrm{nuc}(m) dt -\varepsilon_{\nu}(m)dt+(L(m)-L(m+dm))dt/dm \simeq \varepsilon_\mathrm{nuc}(m) dt -\varepsilon_{\nu}(m)dt-\frac{dL}{dm}dt \ \ .
\end{equation}

</div>
<p>
Thus, substituting in the local energy conservation we obtain:
</p>
<div class="latex" id="org6dafc2a">
\begin{equation}
\frac{dL}{dm} = \varepsilon_\mathrm{nuc}(m) -\varepsilon_{\nu}(m) - \frac{du}{dt} +\frac{P}{\rho^{2}}\frac{d\rho}{dt} \ \ .
\end{equation}

</div>
<p>
Often the last two terms are combined together to define:
</p>
<div class="latex" id="orgab1de5e">
\begin{equation}
\varepsilon_\mathrm{grav} = - \frac{du}{dt} +\frac{P}{\rho^{2}}\frac{d\rho}{dt} = -T\frac{ds}{dt} \ \ .
\end{equation}

</div>
<p>
which being a term dependent on \(dt\) it is usually small for a star in
a static (\(\partial_{t} \simeq 0\)) configuration. However, a star may
occasionally be out of thermal equilibrium (\(du/dt \neq 0\)) and/or
expanding or contracting (\(d\rho/dt\neq0\)). This will change the internal
state of the gas, and that is why it is often convenient to write
things in terms of the (specific) entropy \(s\). Moreover, since most
often this occurs because of contraction/expansion of a star,
historically this has been called \(\varepsilon\) "grav", although it really has
more to do with the internal energy of the gas. With this definition,
the next equation of stellar structure becomes
</p>

<div class="latex" id="orge238ed0">
\begin{equation}
\frac{dL}{dm} = \varepsilon_\mathrm{nuc} -\varepsilon_{\nu} + \varepsilon_\mathrm{grav} \ \ .
\end{equation}

</div>

<p>
<b>N.B.:</b> In regions where no energy is produced (\(\varepsilon_\mathrm{nuc} = 0\)), there are no
neutrino losses (\(\varepsilon_{\nu}=0\)) and in thermal equilibrium (\(\varepsilon_\mathrm{grav} =
T\partial s/\partial t = 0\)), the luminosity is constant as one moves inward or
outward in mass coordinate: \(dL/dm = 0 \Rightarrow L = constant\).
</p>

<ul class="org-ul">
<li><b>Q</b>: can you think of a region of the Sun with constant \(L(m)\)?</li>
</ul>


<p>
<b>N.B.:</b> Once again, we found another equation but it comes with new
unknowns. \(\varepsilon_\mathrm{grav}\) is fortunately only dependent on the thermodynamics
of the gas, so with the EOS we can calculate that (the specific
entropy is also a function of \(\rho\) and \(T\)). The other two terms
instead are input physics for the star. We will <a href="https://www.as.arizona.edu/~mrenzo/materials/nuclear_reaction_rates.pdf">later</a> unpack more
\(\varepsilon_\mathrm{nuc}\) by discussing nuclear energy generation &#x2013; but
ultimately it will depend on cross sections for nuclear interactions
which in stellar physics are taken as known input physics (again
coming often from military research). Similarly, \(\varepsilon_{\nu}\) depends on
neutrino physics and contains many neutrino loss terms. We will
discuss also these a bit more later on, but effectively in stellar
physics \(\varepsilon_{\nu}\) is also a quantity that we assume to know as a function
of \(T\) and \(\rho\), borrowing the work of neutrino and particle physicists.
</p>

<p>
So, in total at this point, we have \(\kappa\), \(\varepsilon_{\nu}\),
\(\varepsilon_\mathrm{nuc}\) assumed to be known input physics, and we have an
equation for the local conservation of energy, and the energy
transport in the case of diffusion (mediated by photons or particles,
i.e. conduction).
</p>

<p>
We still need an equation for the convective energy transport, and
while unpacking \(\varepsilon_\mathrm{nuc}\) we will write a set of equations for
the chemical evolution due to nuclear burning, but we are getting
close!
</p>
</div>
</div>
</div>
