html-content/notes-lecture-ETransport.html

<div id="outline-container-orga857f16" class="outline-2">
<h2 id="orga857f16"><a href="#orga857f16">Homework</a></h2>
<div class="outline-text-2" id="text-orga857f16">
</div>
<div id="outline-container-org0279815" class="outline-3">
<h3 id="org0279815"><a href="#org0279815">Eddington Luminosity</a></h3>
<div class="outline-text-3" id="text-org0279815">
<p>
Consider an optically thick, hot, and stratified gas: this could be
(some layers of) a star, or a sufficiently dense accretion or
decretion flow to/from a compact object. Because of the assumption of
optical thickness, we can assume that the layer is in LTE and the
radiation field is well approximated by a black body. If the gas is
sufficiently hot, radiation pressure is the dominant term
(\(P_\mathrm{rad} \gg P_\mathrm{gas}\)).
</p>
<ol class="org-ol">
<li>Write \(dP_\mathrm{rad}/dr\) as a function of \(L\), \(\kappa\), and \(\rho\) and
\(r\) expressing \(dT/dr\) assuming energy is transported throughout
our layer of gas by radiative diffusion.</li>
<li>Impose hydrostatic equilibrium for this gas, and derive the
functional form for the luminosity (call it \(L_\mathrm{Edd}\))
required for radiation pressure in an optically thick gas to
balance out gravity.</li>
</ol>

<p>
The expression that you found was first derived by <a href="https://en.wikipedia.org/wiki/Arthur_Eddington">Arthur Eddington</a>,
assuming that \(\kappa \equiv \kappa_{es} = 0.2(1+X)\) g cm<sup>-2</sup>. In this derivation you did
not need to assume anything for \(\kappa\): the expression you derived is
sometimes referred to as "modified Eddington Luminosity". Because of
its dependence on \(\kappa\), which we will see can vary throughout the star,
it can occasionally occur that \(L_\mathrm{Edd} <L\): in this case
radiative energy transport and hydrostatic equilibrium cannot be
simultaneously satisfied - and this occurs in the envelope of massive
stars for example. For an (optically thick) accretion flow, this
luminosity corresponds to the limit when the in-falling material
liberates gravitational potential in the form of heat to the point
that the photons produced balance out the gravitational pull that
brings in the in-falling material in the first place.
</p>

<p>
<b>N.B.:</b> the only central hypothesis necessary to derive the Eddington
luminosity here is that the photons are a black body, that is an
optically thick environment is necessary.
</p>
</div>
</div>

<div id="outline-container-org48f5345" class="outline-3">
<h3 id="org48f5345"><a href="#org48f5345">Exercise 5.3 in Onno Pols' lecture notes</a></h3>
<div class="outline-text-3" id="text-org48f5345">
<p>
Without solving the stellar structure equations, we can already derive
useful scaling relations. In this question you will use the equation
for radiative energy transport with the equation for hydrostatic
equilibrium to derive a scaling relation between the mass and the
luminosity of a star.
</p>
<ol class="org-ol">
<li>Derive how the central temperature, \(T_\mathrm{center}\), scales
with the total mass \(M\), outer radius \(R\), and luminosity \(L\), for
a star in which the energy transport is by radiation. To do this,
use the stellar structure equation for the temperature gradient in
radiative equilibrium (<b>hint:</b> use the \(dT/dr\) form).</li>
<li>Assume that \(r \sim R\) and that the temperature is proportional to
\(T_\mathrm{center}\), \(L(m) \sim L\) and estimating \(dT/dr ∼
   −T_\mathrm{center} /R\).</li>
<li>Derive how \(T_\mathrm{center}\) scales with \(M\) and \(R\), using the hydrostatic
equilibrium equation, and assuming that the ideal gas EOS holds.</li>
<li>Combine the results obtained in 1. and 2., to derive how \(L\) scales
with \(M\) and \(R\) for a star whose energy transport is radiative throughout.</li>
</ol>

<p>
You have arrived at a mass-luminosity relation <i>without assuming
anything about how the energy is produced</i>, only about how it is
transported (by radiation). This shows that the luminosity of a star
is not determined by the rate of energy production in the centre, but
by how fast it can be transported to the surface: <b>stars don't shine
because they burn, conversely they burn because they shine!</b>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">
  <hr>
  <a href="#light-dark-toggle"><i id="light-dark-toggle"><i class="fa-solid fa-circle-half-stroke"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="notes-lecture-EOS2.html"><i class="fa-solid fa-arrow-left"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="#top"><i class="fa-solid fa-arrow-up" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="notes-lecture-kappa.html"><i class="fa-solid fa-arrow-right" style="font-size:16px"></i></a>&emsp;&emsp;&emsp;&emsp;<a href="https://github.com/mathren/stellar_phys_400A"><i class="fa-brands fa-github" style="font-size:16px"></i></a><hr>
  <br>
  Last updated on 13 February 2025 <br>
  Made with Emacs 28.1 - Org mode 9.5.2
  <br>
</div>
</div>
</body>
</html>
